# EJERCICIO-01
Escribir un programa que pregunte al usuario por las ventas de un rango de años y muestre por pantalla una serie con los datos de las ventas indexada por los años, antes y después de aplicarles un descuento del 10%.

In [2]:
import pandas as pd

inicio = int(input('Introduce el año inicial: '))
fin = int(input('Introduce el año final: '))
ventas = {}
for i in range(inicio, fin+1):
    ventas[i] = float(input('Introduce las ventas del año ' + str(i) +': '))
ventas = pd.Series(ventas)
print('Ventas\n', ventas)
print('Ventas con descuento\n', ventas*0.9)

Introduce el año inicial: 2018
Introduce el año final: 2021
Introduce las ventas del año 2018: 150000.0
Introduce las ventas del año 2019: 160000.0
Introduce las ventas del año 2020: 110000.0
Introduce las ventas del año 2021: 200000.0
Ventas
 2018    150000.0
2019    160000.0
2020    110000.0
2021    200000.0
dtype: float64
Ventas con descuento
 2018    135000.0
2019    144000.0
2020     99000.0
2021    180000.0
dtype: float64

# EJERCIO-2
Escribir una función que reciba un diccionario con las notas de los alumnos en curso en un examen y devuelva una serie con la nota mínima, la máxima, media y la desviación típica.

In [8]:
import pandas as pd
def nota_observacion(notas):
    notas = pd.Series (notas)
    estadisticos = pd.Series([notas.min(), notas.max(), notas.mean(), notas.std()], index=['Min', 'Max', 'Media', 'Desviación típica'])
    return estadisticos

notas = {'Alejandra':10.5, 'Emir':8.5, 'Angel':9, 'cinthia': 8.5, 'Maria': 5}
print(nota_observacion (notas))

Min                   5.000000
Max                  10.500000
Media                 8.300000
Desviación típica     2.018663
dtype: float64

# EJERCICIO 3# 
Escribir una función que reciba undiccionario con las notas de los alumnos en curso en un examen y devuelva una serie con las notas de los alumnos aprobados ordenadas de mayor a menor.

In [9]:
import pandas as pd

def lista_aprobados(notas):
    notas = pd.Series(notas)
    return notas[notas >= 5].sort_values(ascending=False)

notas = {'Juan':9, 'María':6.5, 'Pedro':4, 'Carmen': 8.5, 'Luis': 5}
print(lista_aprobados(notas))

Juan      9.0
Carmen    8.5
María     6.5
Luis      5.0
dtype: float64

# EJERCICIO-04
Escribir programa que genere y muestre por pantalla un DataFrame con los datos de la tabla siguiente:
                        
                         
| Mes     | Ventas | Gastos |
| ------- | -----: | -----: |
| Enero   |  30500 |  22000 |
| Febrero |  35600 |  23400 |
| Marzo   |  28300 |  18100 |
| Abril   |  33900 |  20700 |

In [15]:
import pandas as pd
DATOS = {'Mes':['Enero', 'Febrero', 'Marzo', 'Abril'], 'Ventas':[30500, 35600, 28300, 33900], 'Gastos':[22000, 23400, 18100, 20700]}
cont = pd.DataFrame(DATOS)
print(cont)

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23400
2    Marzo   28300   18100
3    Abril   33900   20700

# Ejercicio 5
Escribir una función que reciba un DataFrame con el formato del ejercicio anterior, una lista de meses, ydevuelva el balance (ventas -gastos) total en los meses indicados.

In [17]:
import pandas as pd

DATOS = {'Mes':['Enero', 'Febrero', 'Marzo', 'Abril'], 'Ventas':[30500, 35600, 28300, 33900], 'Gastos':[22000, 23400, 18100, 20700]}

cont = pd.DataFrame(DATOS)

def balance(contabilidad, meses):
    contabilidad['Balance'] = contabilidad.Ventas - contabilidad.Gastos
    return contabilidad[contabilidad.Mes.isin(meses)].Balance.sum()

print(balance(contabilidad, ['Enero','Marzo']))

18700

# Ejercicio 6
El fichero [cotizacion.csv](https://github.com/asalber/aprendeconalf/blob/master/content/es/docencia/python/ejercicios/soluciones/pandas/cotizacion.csv)  contiene las cotizaciones delas empresas del IBEX35 con las siguientes columnas: nombre(nombre de la empresa), Final(precio de la acción al cierre de bolsa), Máximo(precio máximo de la acción durante la jornada), Mínimo(precio mínimo de la acción durante la jornada), volumen(Volumen al cierre de bolsa), Efectivo(capitalización al cierre en miles de euros). Construir una función que construya un DataFrame a partir deun fichero con el formato anterior y devuelva otro DataFrame con el mínimo, el máximo y la media de dada columna.

# EJERCICIO-07
El fichero titanic.csv contiene información sobre los pasajeros del Titanic. Escribir un programa con los siguientes requisitos

1.   Generar un DataFrame con los datos del fichero
2.   Mostrar por pantalla las dimensiones del DataFrame, el número de datos que
3.   contiene, los nombres de sus columnas y filas, los tipos de datos de las  
4.   columnas, las 10 primeras filas y las 10 últimas filas.
5.   Mostrar por pantalla los datos del pasajero con identificador 148.
6.    Mostrar por pantalla las filas pares del DataFrame.
7.    Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
8.   Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.
9.    Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.
20.  Eliminar del DataFrame los pasajeros con edad desconocida.
11.  Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.
11. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
12. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.
14.    Mostrar por pantalla los datos del pasajero con identificador 148.
15. Mostrar por pantalla las filas pares del DataFrame.
16. Mostrar por pantalla los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
17. Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron.
19. Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase.
19. Eliminar del DataFrame los pasajeros con edad desconocida.
20. Mostrar por pantalla la edad media de las mujeres que viajaban en cada clase.
21. Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
22. Mostrar por pantalla el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.

In [33]:
import pandas as pd

# Generar un DataFrame con los datos del fichero.
titanic = pd.read_csv('titanic 1.csv', index_col=0)

print(titanic)

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[891 rows x 11 columns]

In [34]:
# Mostrar por pantalla las dimensiones del DataFrame, el número de datos que contiene,
# los nombres de sus columnasy filas, los tipos de datos de las columnas, las 10 primeras filas y las 10 últimas filas.
print('Dimensiones:', titanic.shape)
print('Número de elemntos:', titanic.size)
print('Nombres de columnas:', titanic.columns)
print('Nombres de filas:', titanic.index)
print('Tipos de datos:\n', titanic.dtypes)
print('Primeras 10 filas:\n', titanic.head(10))
print('Últimas 10 filas:\n', titanic.tail(10))

Dimensiones: (891, 11)
Número de elemntos: 9801
Nombres de columnas: Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Nombres de filas: Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            882, 883, 884, 885, 886, 887, 888, 889, 890, 891],
           dtype='int64', name='PassengerId', length=891)
Tipos de datos:
 Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object
Primeras 10 filas:
              Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
6                   0       3  ...   NaN        Q
7                   0       1  ...   E46        S
8                   0       3  ...   NaN        S
9                   1       3  ...   NaN        S
10                  1       2  ...   NaN        C

[10 rows x 11 columns]
Últimas 10 filas:
              Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
882                 0       3  ...   NaN        S
883                 0       3  ...   NaN        S
884                 0       2  ...   NaN        S
885                 0       3  ...   NaN        S
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
889                 0       3  ...   NaN        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[10 rows x 11 columns]

In [35]:
# Mostrar por pantalla los datos del pasajero con identificador 148
print(titanic.loc[148])

Survived                                   0
Pclass                                     3
Name        Ford, Miss. Robina Maggie "Ruby"
Sex                                   female
Age                                        9
SibSp                                      2
Parch                                      2
Ticket                            W./C. 6608
Fare                                  34.375
Cabin                                    NaN
Embarked                                   S
Name: 148, dtype: object

In [36]:
# Mostrar por pantalla las filas pares del DataFrame.
print(titanic.iloc[range(0,titanic.shape[0],2)])

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
3                   1       3  ...   NaN        S
5                   0       3  ...   NaN        S
7                   0       1  ...   E46        S
9                   1       3  ...   NaN        S
...               ...     ...  ...   ...      ...
883                 0       3  ...   NaN        S
885                 0       3  ...   NaN        S
887                 0       2  ...   NaN        S
889                 0       3  ...   NaN        S
891                 0       3  ...   NaN        Q

[446 rows x 11 columns]

In [37]:
# Mostrar los nombres de las personas que iban en primera clase ordenadas alfabéticamente.
print(titanic[titanic["Pclass"]==1]['Name'].sort_values())

PassengerId
731                      Allen, Miss. Elisabeth Walton
306                     Allison, Master. Hudson Trevor
298                       Allison, Miss. Helen Loraine
499    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
461                                Anderson, Mr. Harry
                            ...
156                        Williams, Mr. Charles Duane
352             Williams-Lambert, Mr. Fletcher Fellows
56                                   Woolner, Mr. Hugh
556                                 Wright, Mr. George
326                           Young, Miss. Marie Grice
Name: Name, Length: 216, dtype: object

In [38]:
# Mostrar por pantalla el porcentaje de personas que sobrevivieron y murieron
print(titanic['Survived'].value_counts()/titanic['Survived'].count() * 100)

# Alternativa
print(titanic['Survived'].value_counts(normalize=True) * 100)

0    61.616162
1    38.383838
Name: Survived, dtype: float64
0    61.616162
1    38.383838
Name: Survived, dtype: float64

In [39]:
#Mostrar por pantalla el porcentaje de personas que sobrevivieron en cada clase
print(titanic.groupby('Pclass')['Survived'].value_counts(normalize=True))

Pclass  Survived
1       1           0.629630
        0           0.370370
2       0           0.527174
        1           0.472826
3       0           0.757637
        1           0.242363
Name: Survived, dtype: float64

In [40]:
# Eliminar del DataFrame los pasajeros con edad desconocida.
titanic.dropna(subset=['Age'])

# Alternativa 
# titanic = titanic[titanic['Age'].notna(

             Survived  Pclass  ... Cabin Embarked
PassengerId                    ...
1                   0       3  ...   NaN        S
2                   1       1  ...   C85        C
3                   1       3  ...   NaN        S
4                   1       1  ...  C123        S
5                   0       3  ...   NaN        S
...               ...     ...  ...   ...      ...
886                 0       3  ...   NaN        Q
887                 0       2  ...   NaN        S
888                 1       1  ...   B42        S
890                 1       1  ...  C148        C
891                 0       3  ...   NaN        Q

[714 rows x 11 columns]

In [41]:
# Mostrar la edad media de las mujeres que viajaban en cada clase.
print(titanic.groupby(['Pclass','Sex'])['Age'].mean().unstack()['female'])

Pclass
1    34.611765
2    28.722973
3    21.750000
Name: female, dtype: float64

In [43]:
# Añadir una nueva columna booleana para ver si el pasajero era menor de edad o no.
titanic['Young'] = titanic['Age'] < 18

In [44]:
# Mostrar el porcentaje de menores y mayores de edad que sobrevivieron en cada clase.
print(titanic.groupby(['Pclass', 'Young'])['Survived'].value_counts(normalize = True) * 100)

Pclass  Young  Survived
1       False  1           61.274510
               0           38.725490
        True   1           91.666667
               0            8.333333
2       False  0           59.006211
               1           40.993789
        True   1           91.304348
               0            8.695652
3       False  0           78.208232
               1           21.791768
        True   0           62.820513
               1           37.179487
Name: Survived, dtype: float64